#RSA中的e和phi不互素，利用AMM拓展算法开根求解
#不懂数学原理的话也不要紧，可上网找到模板，直接代入
#简而言之就是先用sagemath求解两个模意义下的多项式的解，再用中国剩余定理（CRT）组合得到答案
from Crypto.Util.number import long_to_bytes
import libnum
p= 182756071972245688517047475576147877841
q= 305364532854935080710443995362714630091
res1 = [(129837097923395210801798309962414834552, 1), (93313355184984066083236894659279572056, 1), (89442716787261622433810580916868305785, 1), (52918974048850477715249165613733043289, 1)]
res2 = [(261934047942669636570395955764280435960, 1), (43430484912265444140048039598434194131, 1)]
for i in res1:
    for j in res2:
        m = libnum.solve_crt([int(i[0]),int(j[0])],[p,q])
        flag = long_to_bytes(m)
        if b'NSSCTF' in flag:
            print(flag)